/*
 * Copyright (C) 2020 菟子
 *
 * 　　Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
 * 　　
 * 　　The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

package yxjh.Sokoban;

/**
 *
 * @description: 存储所有关卡的地图初始数据，根据关卡数返回指定关卡地图的拷贝数组
 * @return:
 * @author: 于子慧
 * @time: 2020/10/23 20:17
 */


public class MapFactory {//地图数据类

	static byte[][][] map = {
			{
					{0, 0, 1, 1, 1, 0, 0, 0},
					{0, 0, 1, 4, 1, 0, 0, 0},
					{0, 0, 1, 9, 1, 1, 1, 1},
					{1, 1, 1, 2, 9, 2, 4, 1},
					{1, 4, 9, 2, 5, 1, 1, 1},
					{1, 1, 1, 1, 2, 1, 0, 0},
					{0, 0, 0, 1, 4, 1, 0, 0},
					{0, 0, 0, 1, 1, 1, 0, 0}
			},
			{
					{1, 1, 1, 1, 1, 0, 0, 0, 0},
					{1, 9, 9, 5, 1, 0, 0, 0, 0},
					{1, 9, 2, 2, 1, 0, 1, 1, 1},
					{1, 9, 2, 9, 1, 0, 1, 4, 1},
					{1, 1, 1, 9, 1, 1, 1, 4, 1},
					{0, 1, 1, 9, 9, 9, 9, 4, 1},
					{0, 1, 9, 9, 9, 1, 9, 9, 1},
					{0, 1, 9, 9, 9, 1, 1, 1, 1},
					{0, 1, 1, 1, 1, 1, 0, 0, 0}
			},
			{
					{1, 1, 1, 1, 1, 0, 0, 0, 0},
					{1, 9, 9, 9, 1, 1, 0, 0, 0},
					{1, 9, 2, 9, 9, 1, 0, 0, 0},
					{1, 1, 9, 2, 9, 1, 1, 1, 1},
					{0, 1, 1, 1, 5, 4, 9, 9, 1},
					{0, 0, 1, 9, 9, 4, 1, 9, 1},
					{0, 0, 1, 9, 9, 9, 9, 9, 1},
					{0, 0, 1, 1, 1, 1, 1, 1, 1}
			},
			{
					{0, 0, 1, 1, 1, 1},
					{0, 1, 1, 9, 9, 1},
					{1, 1, 9, 2, 9, 1},
					{1, 4, 2, 9, 5, 1},
					{1, 2, 4, 9, 1, 1},
					{1, 4, 9, 1, 1, 0},
					{1, 1, 1, 1, 0, 0}
			},

			{
					{1, 1, 1, 1, 1, 1},
					{1, 9, 5, 9, 9, 1},
					{1, 9, 2, 9, 9, 1},
					{1, 2, 9, 1, 1, 1},
					{1, 4, 9, 4, 1, 0},
					{1, 1, 1, 1, 1, 0}
			},
			{
					{0, 0, 0, 1, 1, 1, 1, 0, 0},
					{0, 0, 1, 1, 9, 9, 1, 1, 0},
					{1, 1, 1, 9, 5, 2, 4, 1, 1},
					{1, 9, 9, 9, 9, 2, 4, 9, 1},
					{1, 9, 9, 9, 1, 2, 4, 9, 1},
					{1, 1, 1, 1, 1, 9, 1, 9, 1},
					{0, 0, 0, 0, 1, 9, 9, 9, 1},
					{0, 0, 0, 0, 1, 1, 1, 1, 1}
			},


			{
					{0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},//19行
					{0, 0, 0, 0, 1, 9, 9, 9, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
					{0, 0, 0, 0, 1, 2, 9, 9, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
					{0, 0, 1, 1, 1, 9, 9, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0},
					{0, 0, 1, 9, 9, 2, 9, 2, 9, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0},
					{1, 1, 1, 9, 1, 9, 1, 1, 9, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1},
					{1, 9, 9, 9, 1, 9, 1, 1, 9, 1, 1, 1, 1, 1, 9, 9, 4, 4, 1},
					{1, 9, 2, 9, 9, 2, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 4, 4, 1},
					{1, 1, 1, 1, 1, 9, 1, 1, 1, 9, 1, 5, 1, 1, 9, 9, 4, 4, 1},
					{0, 0, 0, 0, 1, 9, 9, 9, 9, 9, 1, 1, 1, 1, 1, 1, 1, 1, 1},
					{0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0}
			},
			{
					{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0},//14行
					{1, 4, 4, 9, 9, 1, 9, 9, 9, 9, 9, 1, 1, 1},
					{1, 4, 4, 9, 9, 1, 9, 2, 9, 9, 2, 9, 9, 1},
					{1, 4, 4, 9, 9, 1, 2, 1, 1, 1, 1, 9, 9, 1},
					{1, 4, 4, 9, 9, 9, 9, 5, 9, 1, 1, 9, 9, 1},
					{1, 4, 4, 9, 9, 1, 9, 1, 9, 9, 2, 9, 1, 1},
					{1, 1, 1, 1, 1, 1, 9, 1, 1, 2, 9, 2, 9, 1},
					{0, 0, 1, 9, 2, 9, 9, 2, 9, 2, 9, 2, 9, 1},
					{0, 0, 1, 9, 9, 9, 9, 1, 9, 9, 9, 9, 9, 1},
					{0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}
			},
			{
					{0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0},//17行
					{0, 0, 0, 0, 0, 0, 0, 0, 1, 9, 9, 9, 9, 9, 5, 1, 0},
					{0, 0, 0, 0, 0, 0, 0, 0, 1, 9, 2, 1, 2, 9, 1, 1, 0},
					{0, 0, 0, 0, 0, 0, 0, 0, 1, 9, 2, 9, 9, 2, 1, 0, 0},
					{0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 2, 9, 2, 9, 1, 0, 0},
					{1, 1, 1, 1, 1, 1, 1, 1, 1, 9, 2, 9, 1, 9, 1, 1, 1},
					{1, 4, 4, 4, 4, 9, 9, 1, 1, 9, 2, 9, 9, 2, 9, 9, 1},
					{1, 1, 4, 4, 4, 9, 9, 9, 9, 2, 9, 9, 2, 9, 9, 9, 1},
					{1, 4, 4, 4, 4, 9, 9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1},
					{1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0}
			},
			{
					{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0},//19行
					{0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 9, 9, 1, 0, 0, 0, 0, 0},
					{0, 0, 0, 1, 1, 1, 9, 5, 1, 1, 1, 2, 9, 1, 0, 0, 0, 0, 0},
					{0, 0, 1, 1, 9, 9, 9, 9, 9, 9, 2, 9, 9, 1, 0, 0, 0, 0, 0},
					{0, 1, 1, 9, 9, 2, 9, 2, 2, 1, 1, 9, 1, 1, 0, 0, 0, 0, 0},
					{0, 1, 9, 9, 1, 2, 1, 1, 9, 9, 9, 9, 9, 1, 0, 0, 0, 0, 0},
					{0, 1, 9, 1, 9, 2, 9, 2, 2, 9, 1, 9, 1, 1, 1, 0, 0, 0, 0},
					{0, 1, 9, 9, 9, 2, 9, 1, 9, 9, 1, 9, 2, 9, 1, 1, 1, 1, 1},
					{1, 1, 1, 1, 9, 9, 9, 9, 1, 9, 9, 2, 2, 9, 1, 9, 9, 9, 1},
					{1, 1, 1, 1, 9, 1, 1, 9, 2, 9, 9, 9, 9, 9, 9, 9, 9, 9, 1},
					{1, 4, 9, 9, 9, 9, 1, 1, 1, 9, 9, 1, 1, 1, 1, 1, 1, 1, 1},
					{1, 4, 4, 9, 4, 4, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0},
					{1, 4, 4, 4, 1, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
					{1, 4, 4, 4, 4, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
					{1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}

			}

	};
	static int count = map.length;


	public static byte[][] getMap(int grade) {
		byte[][] temp;
		if (grade >= 0 && grade < count) {
			temp = map[grade];
		} else {
			temp = map[0];
		}

		int row = temp.length;
		int column = temp[0].length;
		byte[][] result = new byte[row][column];//备份关卡版本
		for (int i = 0; i < row; i++) {
			for (int j = 0; j < column; j++) {
				result[i][j] = temp[i][j];
			}
		}

		return result;
	}

	public static int getCount() {
		return count;
	}

}
